---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralInstanceUsage
source: html/e536d231-3150-e5bc-7cfd-83e58b05bc75.htm
---
# Autodesk.Revit.DB.Structure.StructuralInstanceUsage

Represents the structural usage of a family instance.

## Syntax (C#)
```csharp
public enum StructuralInstanceUsage
```